% Задание 5. Найти область сходимости функционального ряда
syms x n R An L l k
An = 1 / (n*9^n);
R = limit((1/An)^(1/n));
if (R~=inf)
    %находим границы интервала
    L=solve((x-1)^2 - 1/9, x);
    fprintf('интервал сходимости: (-inf; %d) U (%d; +inf)\n', subs(L(1)), subs(L(2)));
    %проверяем входимость точек в область сходимости
    l=limit(1/(n*9^n*(L(1)-1)^(2*n))^(1/n));
    k=limit(1/(n*9^n*(L(2)-1)^(2*n))^(1/n));
    if (subs(l) < 1)
        fprintf('точка %d включена в область сходимости\n', subs(L(1)));
    else
        fprintf('точка %d не включена в область сходимости\n', subs(L(1)));
    end    
    if (subs(k) < 1)
        fprintf('точка %d включена в область сходимости\n', subs(L(2)));
    else
        fprintf('точка %d не включена в область сходимости\n', subs(L(2)));
    end
else
    disp('Ряд расходится');
end
% Результат: интервал сходимости: (-Inf; 2/3) U (4/3; +Inf)
% точка 2/3 не включена в область сходимости
% точка 4/3 не включена в область сходимости