%Исследование на равномерную сходимость
%Поведение частичных сумм изображено на графике
%Ряд: ((-1)^n)*(x^n)/(5*n-7) n = 1,2...
syms x s eps N f n;
assume(0<=x<=1);
f = (x^n)/(6*n-11);
%Проверяем, сходится ли ряд
if(limit(f,n,inf) == 0)
    hold on;
    eps = 0.1;
    %s = 0;
    N = ceil((1+5*eps)/(6*eps));
    x = 0:1/20:1; 
    %Строим трубку и саму функцию
    plot(x,symsum(((-1)^n).*((x.^n)/(5*n-7)),n,1,inf)+eps,'-.r');
    plot(x,symsum(((-1)^n).*((x.^n)/(5*n-7)),n,1,inf)-eps,'-.r');
    plot(x,symsum(((-1)^n).*((x.^n)/(5*n-7)),n,1,inf),'-*k');
    %Смотрим, попадаем ли мы в трубку при найденом значении
    for i = 1 : 5
        plot(x,symsum(((-1)^n).*((x.^n)/(5*n-7)),n,1,N),'-.b');
        N = N+1;
    end;
else
    disp('Ряд расходится');
end;